import '../styles/about.css';

function AboutFeature() {
  return (
    <section className="about-card">
      <h3>درباره StudyFlow</h3>
      <p>
        StudyFlow یک برنامه مدیریت مطالعه و برنامه‌ریزی شخصی است که با هدف کمک به دانشجویان و
        دانش‌آموزان برای داشتن مطالعه‌ای منظم‌تر و هدفمندتر طراحی شده است.
      </p>
      <p>
        این برنامه امکانات مختلفی برای مدیریت بهتر زمان و فعالیت‌های درسی در اختیار کاربران قرار
        می‌دهد؛ از جمله ثبت برنامه هفتگی، مدیریت اهداف مطالعاتی، ثبت یادداشت‌ها، پیگیری زمان
        مطالعه و مشاهده روند پیشرفت روزانه و هفتگی.
      </p>
      <p>
        هدف اصلی این پروژه ایجاد محیطی ساده، کاربردی و منظم برای افزایش تمرکز، برنامه‌ریزی بهتر و
        بهبود عادت‌های مطالعه است تا کاربران بتوانند فعالیت‌های درسی خود را راحت‌تر مدیریت کرده و
        عملکرد بهتری در طول زمان داشته باشند.
      </p>
    </section>
  );
}

export default AboutFeature;
